app/controllers/cron_jobs_controller.rb

  def index
    @cron_jobs = Current.user.cron_jobs.order(id: :desc)
---
SELECT "cron_jobs".* FROM "cron_jobs" WHERE "cron_jobs"."user_id" = 1 ORDER BY "cron_jobs"."id" DESC
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def create
    @cron_job = Current.user.cron_jobs.build(params.expect(cron_job: [ :name, :expression ]))
    @cron_job.next_run_at = Time.now + 1.year
    @cron_job.external_uuid = Time.now.to_i.to_s

    if @cron_job.save
---
INSERT INTO "cron_jobs" ("external_uuid", "name", "expression", "last_run_at", "next_run_at", "user_id", "created_at", "updated_at", "status") VALUES ('123', 'test', '* * * * * *', NULL, '2026-03-25 13:24:35.971388', 1, '2025-03-25 13:24:35.972487', '2025-03-25 13:24:35.972487', 'active') RETURNING "id"

  def edit
    @cron_job = Current.user.cron_jobs.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "cron_jobs".* FROM "cron_jobs" WHERE "cron_jobs"."user_id" = 1 AND "cron_jobs"."id" = 3 LIMIT 1

  def update
    @cron_job = Current.user.cron_jobs.find(params[:id])

    if @cron_job.update(params.expect(cron_job: [ :name, :expression ]))
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "cron_jobs".* FROM "cron_jobs" WHERE "cron_jobs"."user_id" = 1 AND "cron_jobs"."id" = 3 LIMIT 1
UPDATE "cron_jobs" SET "name" = '321', "expression" = '123', "updated_at" = '2025-03-24 19:41:53.470266' WHERE "cron_jobs"."id" = 3

  def destroy
    @cron_job = Current.user.cron_jobs.find(params[:id])
    @cron_job.status = :paused

    @cron_job.save!
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "cron_jobs".* FROM "cron_jobs" WHERE "cron_jobs"."user_id" = 1 AND "cron_jobs"."id" = 3 LIMIT 1
UPDATE "cron_jobs" SET "updated_at" = '2025-03-24 20:02:07.003492', "status" = 'paused' WHERE "cron_jobs"."id" = 1